/*************************************************************************
	> File Name: min_ci.c
	> Author: 
	> Mail: 
	> Created Time: 2017年11月21日 星期二 22时11分38秒
 ************************************************************************/
    //最简版
#include<stdio.h>
int main()
{
    int  a[5] = {1,2,1,5,4};
    int  k1=0,k2=1;
    int  j=0,t;
  /*  if(a[k2] < a[k1] )
        {
            t = k2;
            k2 = k1;
            k1  = t;
        }  */

    for (j = 2 ; j< 5 ; j++)
    {
        if(a[k2] < a[k1] )
        {
            t = k2;
            k2 = k1;
            k1  = t;
        }
        if(a[j] < a[k2])
        {
            k2 = j;
        }
    }
    printf("min= %d ci_min= %d\n ",k1,k2 );
}

